{
  "appTitle": "Puban, a made-up cipher",
  "pages": {
    "home": {
      "meta": {
        "title": "Homepage",
        "description": "Puban is a made-up cipher that uses Ubbi Dubbi and PigLatin to encrypt messages"
      },
      "pubanDescription": "A made-up cipher that uses <0>Ubbi Dubbi</0> and <1>PigLatin</1>.",
      "pageUse": "You can encrypt/decrypt from Puban and its components here.",
      "discordBot": "There's also a <0>Discord bot</0> you can set up!",
      "input": {
        "placeholder": "Text to be encrypted or decrypted goes here"
      },
      "output": {
        "placeholder": "Resulting text will show here"
      },
      "copyButton": {
        "action": "Copy result text",
        "done": "Result copied"
      },
      "operation": {
        "options": {
          "encrypt": "Encrypt to",
          "decrypt": "Decrypt from"
        },
        "button": "Go"
      }
    },
    "setup-bot": {
      "meta": {
        "title": "Setting up the bot",
        "description": "Set up the Discord bot that encrypts and decrypts Puban, a made-up cipher"
      },
      "botTitle": "Puban bot",
      "botDescription": "A Discord bot that encrypts to and decrypts from <0>Puban</0>.",
      "pageUse": "The bot is <0>open source</0> and you can set it up yourself!",
      "instructions": {
        "code": "The code is all hosted on Github, over <0>here</0>.",
        "thingsNeeded": {
          "title": "What you'll need",
          "items": {
            "terminal": "A terminal where you can run commands (a Windows command prompt, or an UNIX terminal).",
            "nodejs": "NodeJS, to run the code. <0>NodeJS</0> is a tool that allows running JavaScript out of the browser.",
            "git": "Git, ideally, to easily download the code. <0>Git</0> is a version management tool that also allows for downloading and updating code efficiently."
          }
        },
        "gettingTheCode": {
          "title": "Getting the code",
          "runGitCode": "With Git installed, you can get the code by running",
          "withoutGit": "If you choose to not install Git, you can download the ZIP for the code in the repository website. As it uses a submodule from another repository, you'll also need to download the ZIP from the <0>language repository</0> and ",
          "placeFiles": "place the files from inside the zipped folder inside the <0>languages</0> folder.",
          "readme": "Then, assuming you have NodeJS installed and the code files placed properly, you can follow the instructions on the <0>README</0> file from the repository. It will teach how to install the code's denpedencies, deploy the bot's slash commands and start listening for and responding them."
        },
        "keepingBotOnline": {
          "title": "Keeping the bot online",
          "description": "After you've followed the instructions, as long as your start command is running, your bot will be online! To keep it online continuously, the process will need to run nonstop somewhere. You can choose to deploy on whatever service you prefer, like in <0>AWS EC2</0>, for example. Bear in mind that having a server usually implies costs! For the purpose of just playing around with the bot, running it on your machine will probably be enough."
        },
        "thatsIt": {
          "title": "That's it!",
          "description": "That's it for setting up the bot. I hope you have fun with it! I coded it in a way you can add more languages if you want to. So what are <0>you</0> gonna <1>build</1>?"
        }
      }
    }
  }
}
